<a href="https://colab.research.google.com/github/temple17/python-for-data-analysis-2nd-edition/blob/main/Chapter6(p_185~).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [5]:
import pandas as pd
import numpy as np

In [12]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [13]:
filename = '/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex1.csv'

In [14]:
df = pd.read_csv(filename)

In [15]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [17]:
pd.read_table('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex1.csv', sep = ',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [18]:
pd.read_csv('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex2.csv', header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [19]:
pd.read_csv('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex1.csv', names = ['a','b','c','d','message'])

   a   b   c   d  message
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [20]:
names = ['a','b','c','d','message']

In [25]:
pd.read_csv('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex2.csv', names = names, index_col = 'message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [24]:
parsed = pd.read_csv('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/csv_mindex.csv', index_col = ['key1','key2'])

In [26]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [27]:
list(open('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [28]:
result = pd.read_table('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex3.txt', sep = '\s+')

In [29]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [31]:
pd.read_csv('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex4.csv', skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [32]:
result = pd.read_csv('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex5.csv')

In [33]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [34]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [35]:
result = pd.read_csv('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex5.csv', na_values=['NULL'])

In [36]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [41]:
sentinels = {'message': ['foo','NA'], 'something': ['two']}

In [42]:
pd.read_csv('/content/drive/MyDrive/python_for_data_analysis_2nd_edition/examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN